["Souvenirs de notre tour du monde.","En Egypte: notes et croquis d’un artiste.","The land of the sphinx. With one hundred and eighty-sixillustrations by the author.","notes-books”","Round the world letters: five hundred and forty-two pages of","charming pen pictures by the way, a graphic portrayal of scenes,incidents and adventures of a two years’ tour of the world;beautifully illustrated with fine full page engravings.","Cinq mois au Cairo, et dans la Basse Egypte.","Five months in Cairo.","Across the sea: observations and experiences in Europe and theEast.","A collection of letters written home during a tour to and from Egypt,up the Nile to First cataract.","Behera,","Itineraire descriptif, historique et archeologique de I’Orient.","A voyage round the world in 500 days, with details.","A voyage round the world in 500 days, with details.","Sketches of travel: the East, the Far East and some of the by-pathsthither.","Poiezdka k piramidam.","Sacred Palmlands or the journal of a spring tour [in Egypt and theHoly Land].","Travels in Egypt (December 1880 to May 1891) letters of CharlesEdwin Wilbour, edited by Jean Capart.","Seventy years in archeology.","Ten years’ digging in Egypt (1881-1891).","Court life in Egypt.","Around the world with a king.","A truth seeker around the world A series of letters written whilemaking a tour of the globe.","The Truth Seeker.","Orient sunbeams; or, From the porte to the pyramids, by way ofPalestine.","From the Nile to Norway and homeward.","Reise i fire verdensdele i aarne 1881 og 1882.","Toward the sunrise: being sketches of travel in Europe &amp; the East.To which is added a memorial sketch of the Rev. William MorleyPunshon, Ll.D.","Guardian.","Puteshestvie na Sinai v 1881 godu: iz putevykh vpechatlienii:drevnosti Sinaiskago monastyria.","Voyageurs russe en Egypte,","Griffin ahoy! A yacht cruise to the Levant and wanderings in Egypt,","Syria, the Holy Land, Greece","and Italy, in 1881.","The land of Khemi. Up and down the middle Nile.","Blackwood’sMagazine.","An engineer’s holiday, or, Notes of a round trip from long.","An engineer’s holiday; or, Notes of a round trip from long.","i.e.,","Viaje en torno al mundo por un “Chileno” (julio 1880-julio 1882).","My diary during a foreign tour: in Egypt, India, Ceylon, Australia,New Zealand, Tasmania, Fiji, China, Japan, and North America,in 1881-2.","Egypt, Palestine, and Phoenicia. A visit to Sacred Lands. Trans¬lated from the 8th French edition by Rev. Canon Lyttelton. With asketch of the author, by Professor Godet.","L’Egypte. Notes d’un resident franqais. Edited by A. Ganeval.","L’Egitto antico e moderno.","Utazas a keleten.","Der Orient.","Warm corners in Egypt, by one who was in them.","My six years with the Black watch, 1881-1887; Egyptian campaign,eastern Soudan, Nile expedition, Egyptian frontier field force(including a study of General Charles G. Gordon and his commis¬sion from the British and Egyptian governments to Khartoum).","Eine weltreise. Plaudereien aus einer zweijahrigen erdumsegelungNeuer abdruck.","Some of the personal reminiscences at home and abroad of SimonWolf. Foreword by Hon. Henry B.F. Macfarland; poem by Hon.W.P. Stafford; sketch by Hon. S.J. Peele.","Ruins etpaysages d’Egypte.","Egypt: ancient sites and modern scenes. Translated by ElizabethLee; with seventeen illustrations.","Le Temps, La Revued’Orient","Le Grande revue.","Coins d’Egypte ignores.","Letters of travel in Europe, Egypt and Palestine.","Gettysburg Compiler,","On the desert: with a brief review of recent events in Egypt.","Travels and observations in the Orient and a hasty flight in thecountries of Europe.","The voyage of the “Wanderer,” from the journals and letters of C.and S. Lambert.","U Orient: or, A journal of my tour in the East, March lst-June 30th,","1882.","Over the Holy Land.","Sammlung der Seit dem Jahre 1871 in Aegypten, Belgien, Dane-mark, Grossbritannien und Irland, Guatelmala, Honduras, Italien,Schweden-Norwegen, der Schweiz und Ungarn, publicirtenWechsel-Gesetze, mit Uebersetzung und Amerkungen, etc.","Un hiver au Caire. Journal de voyage en Egypte par Mme LeeChilde.","La derniere Egypte. Texte et dessins par L.L., peintre du departe-ment de la Marine. Edition ornee du portrait de Vauteur parEdouard Detaille.","A visit to the Holy land, Syria and Constantinople.","The cities of Egypt.","From Egypt to Canaan.","Letters from the East, in the spring of1882.","Reminiscences of travel in Australia, America, and Egypt.","Letters from Egypt and the Soudan.","dolce par niente","Cruising in the Orient.","Juanita","Under crescent and star.","Due west; or, Round the world in ten months.","Foot-prints of travel; or, Journeyings in many lands.","Footprints ofTravel","Due West,","The accursed land; or, First steps on the water-way of Edom.","Days in the East; or, Random recollections of Greece, Palestine andEgypt.","Mount Seir, Sinai and West Palestine. Being a narrative of ascientific expedition. With maps and illustrations.","Three months in the Soudan. Photographic plates.","From Ismailia to Cairo with the 4th (Royal Irish) Dragoon Guards.","Voices from the Orient, or, The testimony of the monuments of therecent historical and topographical discoveries: and of the customsand traditions of the people in the Orient to the veracity of the sacredrecord.","Through Egypt, Palestine, and Syria.","Souvenirs du Nil; la premiere Cataracte.","Fra Nilen til Himalaya. Med mange illustrationer.","Nach Aegyptenund demheil. Land. Tagebuchblatter. Mitt 24 Abb.in Lichtdr.","My diary; an account of a five months’ holiday in 1883 and 1884.","Egypt, painted and described.","Egypt.","Century Magazine","Notes of a holiday tour round the world in 1883-4.","A visit to Europe and the Holy Land.","A tour around the world in 1884.","The world as we saw it.","Joining the Navy; or Abroad with Uncle Sam.","Forty thousand miles over land and water.","Via Cornwall to Egypt.","We two alone in Europe.","Eine Orient-Reise.","From the Golden Gate to the Golden Horn A narrative of travel andadventure.","Egipet.","Voyageurs russe en Egypte,","With the camel corps up the Nile.","Les Voyageurs canadiens a Vexpedition du Soudan; ou, Quatre-vingt-dix jours avec les crocodiles Lettres revues, corrigees etaugmentees de notes inedites sur Vexpedition du Soudan; d’unresume des us et coutumes de VEgypte; contenant un autographe du","General Gordon, ainsi qu’une liste des “Voyageurs canadiens”surnommes justement, par le capitaine Thompson: “Les heros duNil!”.","Records of the Nile Voyageurs, 1884-1885; the Canadian VoyageurContingent in the Gordon Relief Expedition.","Some experiences of an old Bromsgrovian: soldiering in Afghani¬stan, Egypt and Uganda.","The repose in Egypt; a medley.","From sketch-book and diary.","Letters from the Holy Land.","Ueber lander und meere.","John Bullsur le Nil. Croquis de I’occupation anglaise (1885).","II mio viaggio in Oriente nelVAutunno dell’anno 1885.","Heart and thought memories of eastern travel.","Johnson’s journey around the world Fifty thousand miles of travel,from the Golden Gate to the Golden Gate.","Traveling alone.","A trip around the world.","Eine Reise um die Welt.","A tour around the world.","New York to the Orient. A series of letters writing a brief tripthrough Europe to Palestine, returning via Egypt, Italy, France, andEngland.","Yankee Gazette.","A girdle round the earth Home letters from foreign lands.","L’Egypte et la Nubie","album monumental, historique, architec¬tural, reproduction de . . . vues photographiques par Bechard","comprises depuis Le Caire (Egypte) jusqua a la 2e cataracte(Nubie).","Around the world.","By Nile and Tigris, a narrative of journeys in Egypt and Mesopota¬mia on behalf of the British museum between the years 1886 and1913.","Prikliucheniia i vpechatlieniia","Italii i Egiptie.","Vospominanie o poiezdkie","Konstantinopol, Kair i Ierusalim.","Pleasant hours in sunny lands, in a tour around the world.","Through distant lands: diary of a tour round the world in 1886-7.","From Nile to Nile Rambles of a Kansan in Europe, Palestine andAfrica.","Wichita Daily Eagle.","Under ten flags An historical pilgrimage.","From Pharaoh to fella. With illustrations by Georges Montbard.Engraved by Charles Barbant.","En vinter pa Nilen af Claes Lagergren.","Vent’ anni in Egitto ricordi di Filippo Pasquinelli.","A winter on the Nile, in Egypt, and in Nubia.","Journal letters from Egypt and Jerusalem.","A race with the sun; or, A sixteen months’ tour from Chicagoaround the world.","Reminiscencias de viajes de Francisco J. Herboso.","Round the globe in old and new paths.","Vospominaniia o sviatykh miestakh vostoka.","En dahabieh.","A girl’s journey through Europe","Egypt, and the Holy Land.","Under eastern skies: the record of a pleasant journey through Biblelands.","Notes on my journey round the world.","Egypt as a winter resort.","Bohemian days.","Ex-mayor Daniel F. Beatty’s tour of the world, embracing Europe,Asia, Africa, Australasia, Polynesia and America.","In Cairo.","menu","My journey to Jerusalem: including travels in England, Scotland,Ireland, France, Belgium, Germany, Holland, Switzerland, Italy,Greece, Turkey, Palestine, and Egypt.","New HavenDaily Journal and Courier.","Po Egiptu i Palestinie.","First American Catholic pilgrimage to Palestine, 1889.","Echoes from foreign shores: letters from Bible lands for children.","Rambler’s travels in classic and Bible lands containing an account ofocean and sea voyages; life, art and industry in Holland, Belgium,France .","together with a descriptive and historic account of thePyramids, the Sphinx, the Nile . . . and ... the Holy Land.","the stream of civilization.","En Egypte. Le Caire, Alexandrie—les pyramides.","How we went and what we saw: a flying trip through Egypt, Syria,and the Aegean Islands.","A Baptist abroad; or travels and adventures in Europe and all Biblelands.","Egyptian sketches.","From the pyramids to the Acropolis; sacred places seen throughBiblical spectacles.","The digressions of V written for his own fun and that of his friend;containing the quaint legends of his infancy, an account of his stayin Florence, the garden of lost opportunities, return home on thetrack of Columbus, his struggle in New York in war-time coincidingwith that of the nation, his prolonged stay in Rome, and likewise hisprattlings upon art, tamperings with literature, struggles with verse,","and many other things, being a portrait of himself from youth to age.","Het land mijner vaderen Indrukken op eene reis door Egypte enPalestina.","A journey to Palestine.","Around the world in seven months.","Around the world on sixty dollars.","A winter jaunt through historic lands Embracing Scotland, En¬gland, Belgium, France.","Du Havre a Marseille par VAmerique et le Japon.","Mentone, Cairo and Corfu.","Harpers Magazine.","The modern Odyssey.","Egypt; three essays on the history","religion and art of ancient Egypt.","The land of holy light.","Alone through Syria.","A descriptive reading on Egypt.","Sketches from a Nile steamer for the use of travellers in Egypt.","Aux pays du Christ, Egypte, Palestine.","Aux pays du Christ, Egypte, Palestine.","Golden adventure; a diary of long ago.","A colored man abroad: what he saw and heard in the Holy Landand Europe.","Augusta Sentinel.","“Clear round!”: seeds of story from other countries.","Afloat and ashore on the Mediterranean.","A little journey.","Wanderfahrten und Wallfahrten im Orient.","Sights around the world with the base ball boys Comprising mostinteresting sketches of the famous sights of the world as they wereseen by the gay travelers on the “round-the-world” tour of Americanbase ball teams.","New York Herald.","Notes for the Nile: together with a metrical rendering of the hymnsof ancient Egypt and of the precepts of Ptah-hotep (the oldest bookin the world).","In the track of the sun; readings from the diary of a globe trotter.","In the track of the sun; readings from the diary of a globe trotter.","The rulers of the Mediterranean.","Zamietki turista.","Letters of Lizzie McMillan.","Wandering in Bible lands: notes of travel in Italy, Greece,","Asia-Minor, Egypt, Nubia, Ethiopia, Cush, and Palestine.","A domine Bible lands.","In Cairo and Jerusalem An eastern note-book.","Our journey around the world; an illustrated record of a year’s","travel of forty thousand miles.","On either side of the Red sea.","A wandering scholar in the Levant.","Accidents of an antiquary’s life.","From Cairo to the Soudan frontier.","Daily Telegraph.","Present-day Egypt.","Our tour around the world containing a description in brief letters ofa tour around the world, through America, Hawaiian Islands, NewZealand, Tasmania, Australia, Ceylon, Egypt, Palestine, Italy,France and England, including ten years residence in New Zealandand Australia.","Christian Standard","ChristianGuide","Holy Land.","Footprints of Jesus in the Holy Land.","Time exposure; the autobiography of William Henry Jackson.","The earth girdled. The world as seen to-day.","An Oriental outing; being a narrative of a cruise along theMediterranean and of visits to historic cities.","Irontown (Ohio) Register.","Promenade en Egypte.","The varied grace of nature's face.","Over the Hills and Far Away","Journeys by land and sea: a visit to five continents.","A private journal in Egypt: from May 1894 to May 1895.","en route","Egypt through the stereoscope; a journey through the land of thePharaohs.","Poiezdka na Vos to k.","Egypte et Palestine.","Vingt mille lieues a travers le monde.","Around the globe and through Bible lands.","Around the world due west to the far east.","A circuit of the globe: a series of letters of travel across the Americancontinent, through the Hawaiian Republic, Japan, China, the StraitsSettlements, Burma, India, Ceylon, Australia, Egypt, Palestine,Syria, Turkey, Greece, Italy, Switzerland, Germany, Scandinavia,France and England.","Girdling the globe From the land of the midnight sun to the GoldenGate. A record of a tour around the world.","Notes of a trip around the world in 1894 and 1895.","“In Mediterranean lands.” The cruise of the Friesland. 1895.","Foreign letters,","Steuben Farmers’ Advocate","Vers I’Orient.","Le Voyage en Orient.","The land of the monuments; notes of Egyptian travel.","To Jerusalem through the lands of Islam among Jews, Christians,and Moslems.","On the Nile with a camera.","In the shadow of Sinai, a story of travel and research from 1895 to1897.","From west to east, or, The Old world as I saw it: being a descriptionof a journey from California to the Holy Land and Egypt, by theway of England, France, Switzerland and Italy.","Fellow travellers; a personally conducted journey in three conti¬nents, with impressions of men, things and events.","A world-pilgrimage.","Chicago Record.","A sunshine trip: glimpses of the Orient.","Oriental days.","then","Viaje por los paises biblicos.","Fodture i JEgypten og Palastina.","Fotturer i /Egypten og Palestina.","Ballade autour du monde.","By Nile and Euphrates; a record of discovery and adventure.","Pages in azure and gold; the letters of Miss Gardiner and MissQuincy.","Three journeys around the world; or, Travels in the Pacific islands,New Zealand, Australia, Ceylon, India, Egypt, &amp; other Orientalcountries.","Um die Erde: Reisebriefe und Aufzeichnungen.","As seen by me.","Mayflower,","Egypt, the land of the temple builders.","The city of the caliphs; a popular study of Cairo and its environs andthe Nile and its antiquities.","One way round the world.","The land of the pharaohs through the perfecscope: describing aseries of one hundred original stereoscopic photographs.","Sketches in Egypt.","Egypt in 1898.","The homely diary of a diplomat in the East, 1897-1899.","The education of Henry Adams.","The education of Henry Adams: an autobiography.","Education,","A journey with the sun around the world.","Le Caire.","The redemption of Egypt.","Pen sketches; streets of Cairo, sphinx and pyramids, Bedouinwedding festival, Venetian serenade, Modern Jerusalem, Colos¬seum illuminated, bazaars of Damascus, Pompeii and Vesuvius.","Evening Telegraph","Philadelphia Inquirer.","Backsheesh; a woman’s wanderings.","The Holy City, Athens and Egypt: founded on personal observationand the researches of modern explorers.","From America to the Orient.","From the Cape to Cairo. The first travers of Africa from South toNorth.","Six months in Bible lands and around the world in fourteen monthswith fifty illustrations.","Min resa jorden rundt.","Egypt and the Nile.","Pyramids and progress: sketches from Egypt.","Our houseboat on the Nile.","Athousand miles up the Nile.","To-day on the Nile","Illustrated with photogravures.","Spring days in two hemispheres.","Around the Mediterranean.","Suemma’s trip around the world.","The land of the khedive.","The complete works of the Swami Vivekananda.","En Egypte, notes de voyage.","Eine Orientreise.","By the overflowing Nile.","Harems et musulmanes d’Egypte.","An Endeavorer’s working journey around the world.","Hacia el oriente.","The leisure of an Egyptian official.","A wayfarer in Egypt.","Letters from Egypt and Palestine.","A trip around the world.","Leominster Daily Enterprise.","Only letters.","Genom Bibelns lander: Allman beskrifning ofver Palestina jamtereseminnen fran det Heliga Landet, Egypten Och Medelhafslan-derna.","On the Nile in 1901.","Twenty thousand miles by land and sea. Experiences and scenes inEurope, Turkey, Egypt, and Palestine.","My trip to the Orient.","The Old world in the new century; being the narrative of a tour of theMediterranean, Egypt and the Holy Land, with some informationabout the voyage and places visited.","Zu Land und See im Orient.","Towards the rising sun; a story of travel and adventure.","Zu land und see im Orient.","Tracks of a tenderfoot In Africa, Asia and Europe.","Egypt, the Sinaitic Desert, and the Holy Land.","Bimbashi McPherson: a life in Egypt.","The old world through new world eyes; the development of theOrient &amp; central Europe &amp; Great Britain traced on chronological &amp;geographical lines.","Visions de route: promenade autour du monde avec S.A.I. legrand-due Boris de Russie.","How","worked my way around the world.","A photographic expedition in Egypt, Palestine","Turkey &amp; Greece.","Rambles through Europe, the Holy Land and Egypt.","A Californian circling the globe; illustrated from photographs.","Redlands (California) Daily Review.","A year’s wandering in Bible lands.","Reminiscencias de viaje, anos 1902-1903.","La nouvelle Egypte.","New Egypt.","Dog fennel in the Orient.","Eight journeys abroad.","O’er oceans and continents with the setting sun 1st series: Chicago,San Francisco, Hawaiian Islands, Japan, China, the Philippines.","Civdad de Dios,","Around the world; a narrative of a tour of the earth, setting forth theexperiences of one who recently made the trip alone, with historicaland descriptive data.","A travers la Haute-Egypte.","Footprints of a Black man: the Holy Land.","Travels and experiences in other lands.","Around the world in ninety days; a book of travel.","Upper room letters from Bible lands.","Wonders of the world abroad; being some reminiscences of a triparound the world.","A trip to the Holy Land.","A pilgrimage to Jerusalem; the story of the cruise to the Worlds’fourth Sunday-school convention.","Mayflower","The book and the land.","T. M. Wiborg’s reisebreve.","Tierras lejanas.","Tierras lejanas.","Egypt, Burma and British Malaysia.","Through isle and empire.","Egypte, Palestine, Syrie, Turquie, Grece, Italie.","A vagabond journey around the world; a narrative of personalexperience.","Working my way around the world.","Around the world garden of Eden, latter day prophecies andmissions.","A Levantine log-book.","Daily notes of a trip around the world.","Atchinson Globe,","A journey ’round the world.","Aegypten 1905.","Three months in foreign lands.","At the gates of the East: a book of travel among historicwonderlands.","Au pays des pyramides.","Cruise to the Orient.","Drei jahre in der Libyschan wuste: reisen, entdeckungen undausgrabungen der Frankfurter Menas expedition (KaufmannscheExpedition).","Three years in the Libyan Desert travels, discoveries andexcavations of the Menas expedition (Kaufmann expedition).","In pastures new.","Le mirage oriental.","Le Voyage en Orient.","Palace","Skitaniia.","The old world and its ways.","Around the world in a year.","Experiences of Mr. and Mrs. Patrick Cudahy on a journey to aportion of the oldest historical parts of the world during the first fourmonths of 1906.","Album of Egyptian and Turkish photographs assembled by Rudolfand Lula H. Reinhart in 1906 on their wedding trip.","Below the cataracts.","Historical spots of the Old world.","Travels in the Far East.","Tales of travel all around the world.","La mort de Philae.","Egypt (La Mort de Philae) by Pierre Loti; translated from theFrench by W.P. Baines; with eight illustrations in colour byA. Lamplough.","Hip! hip!","hip!hurrah . .","Smiling","’round the world.","Egypt and the English, showing British public opinion in Egyptupon the Egyptian question: with chapters on success of the Sudanand the delights of travel in Egypt and the Sudan.","Queer things about Egypt.","Oriental Cairo the city of the “Arabian nights”.","La Mort de Philae","Romantische reise im Orient.","The light side of Egypt.","The people of Egypt.","From Cairo to the cataract.","Letters from across the sea, 1907-1908.","Baedeker","By the waters of Egypt.","Egypt and its monuments.","The spell of Egypt.","Egypt andits monuments.","Travels in the Upper Egyptian deserts.","Blackwood’sMagazine.","Extracts and sketches from my journal of a year’s travel in theOrient and Europe.","Kairo, Bagdad, Konstantinopel: Wanderungen und Stimmungen.","Cairo and its environs.","La morte de Philae","Egypt and How to See It","Extracts from the letters, diary and note books of Amasa StoneMather June 1907 to December 1908.","Around the world; a narrative in letter form of a trip around theworld from October, 1907, to July, 1908.","Under twelve flags.","Die Yankeedoodle-Fahrt: neue Beitrage zur Ktinst des Reisens.","Around the world with a business man.","Dreams of yesterdays (in the Orient).","Unter der Sonne Oberdgyptens, neben den Pfaden der Wissen-schaft: mit 44 Dreifarbenbildern und 133 Netz-Atzungen nachphotographischen Naturaufnahmen des Verfassers.","Glimpses around the world through the eyes of a young American.","Egypt of yesterday and to-day.","Letters written during foreign travel.","Asfar as the East is from the West: tales of a traveler who toured theworld toward the rising sun.","A woman s world tour in a motor.","New Judea: Jewish life in modern Palestine and Egypt.","Voyageurs russe en Egypte.","Our trip to Europe.","Travel notes of an octogenarian.","Aegyptische reiseskizzen.","Under Egypt’s skies.","Mysteries of the Libyan Desert; a record of three years ofexploration in the heart of that vast &amp; waterless region.","National Geographic Magazine.","It tickled him; around the world with George Hoyt Allen.","will","La Follette’s.","40,000 miles around the world: a personal narrative of theexperiences and impressions of an energetic traveller who crossedthe Equator and the Arctic circle in the tour.","The Theodore Roosevelt family in Egypt, from the book Strollsalong the Nile, the river of life; being the reminiscences of a worldtraveller.","Sem’ mesiatsev","Egipte i Palestine Sem’ miesiatsev","Egiptie iPalestinie: ocherki i vpechatlieniia.","Voyageurs russe en Egypte,","Around the world on the Cleveland.","Encircling the globe.","Our trip abroad.","A journalist in the Holy Land; glimpses of Egypt and Palestine.","Au coeur du harem.","My journey from Rhodesia to Egypt.","Round the world in silence.","Minnen och bilderfran Bibelns lander.","Some world-circuit saunterings.","Notes on travels including a trip around the world by way ofAustralia.","Ancient cities and civilizations modernized.","My trip to the Orient.","Jerusalem; Egypt: Palestine: Syria.","The Holy Land.","From job to job around the world.","Egyptian aesthetics.","Journeying round the world; a narrative of personal experience.","Egyptian days.","Our year abroad: random rambles in the old world.","Journeying with Jesus: as the days go by in that dormant land whererest the ashes of patriarchs, prophets and kings of whom the worldwas not worthy.","Titanic,","The quick traveler.","Meine reise nach Jerusalem, skizzen aus Agypten und Paldstina vonrabbiner dr. Armand Kaminka.","A vacation on the Nile; a collection of letters written to friends athome by Lewis Parkhurst; illustrated from photographs by T. W.Gilson and Richard Parkhurst.","Rambling notes of a rambling tour through Egypt, Palestine andEurope.","May¬flower","A diary around the world; 30 countries, 160 places, 37,460 miles,expense.","Around the world by an oculist.","Wayfarers in the Libyan Desert.","Wayfarers in the Libyan Desert.","The critic in the Orient.","Eines arbeiters weltreise.","Gotter, Konige und Tiere in Agypten.","Gotter, Konige und Tiere in Agypten.","Golightly ’round the globe.","Glimpse of the unusual around the world.","The banks of the Nile.","A white woman in a black man’s country: three thousand miles upthe Nile to Rejaf.","Athousand miles up the Nile,","Through Palestine with tent and donkey, and travels in other lands.","Baltimore Southern Methodist","Letters of travel 1892-1913.","Egypt in transition.","Correspondence Ten months on the wing.","Missionary journeys through Bible lands; Italy, Greece, Egypt,Palestine, Syria, Asia Minor and other countries, including a","description of religious and social conditions in Palestine and Syria,personal missionary experiences, and a discussion of missionarymethods.","Glimpses of Palestine and Egypt.","et al.,","A boy’s experiences around the world by the boy himself.","Out of Egypt.","La sonrisa de la esfinge.","Whirl around the world.","Cleveland,","Six and one abroad.","Along Mediterranean shores.","Alexandria: A history and a guide.","Alexandria: A history and a guide.","Une enquete aux pays du Levant.","Glimpses of many lands.","Diary of a trip abroad in 1914: when all the world was at peace andevery nation loved the United States of America.","Gennem de fagre riger—.","A pilgrimage to Palestine.","Au Sinai et dans VArabie Petree.","A trip through Bible lands and Europe; a journalistic record of a","tour made in the summer of 1914, just before the world-wide war.","La route des Indes sauvee par la France.","La route des Indes sauvee par la France.","The spell of Egypt.","Reise zur Suesfront.","Um den Suezkanal.","Als kampfflieger am Suez-Kanal.","Leaves from an officer’s notebook.","The desert campaigns.","On the Anzac trail; being extracts from the diary of a New Zealandsapper.","Rambles in Cairo.","Sphinx","Through Egypt in war-time.","Nile to Aleppo with the Light-horse in the Middle-East."]